# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash :prologue "echo '# OUTPUT:'"
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20241230--03--5+2ghz--no_load
#+EXPORT_FILE_NAME: README
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test group:* =20250210_gh712_peak_jitter= Testing peak jitter calculation.

*Test:* =03--5+2ghz--no_load= 5Ghz and 2.5Ghz Wi-Fi SSIDs (same AP), no external load.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Thu 13 Feb 2025
:end:

*Artifacts:*

| *name*        | *link*            |
|---------------+-------------------|
| receiver dump | [[file:roc_recv.csv.xz][=roc_recv.csv.xz=]] |
| receiver log  | [[file:roc_recv.log.xz][=roc_recv.log.xz=]] |
| sender log    | [[file:roc_send.log.xz][=roc_send.log.xz=]] |

*Jupyter notebook:*

[[file:README.ipynb][=README.ipynb=]]

** Software info

- *git revisions*

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit 62100a71dc06c20b94304110e6d228083fdd8125
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     chore: Use nanoseconds for all jitter entries in dump

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit e8afcd190cda52198cc13a89cad7479e2ae5bba6
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     "Decimation"

- *roc-toolkit version*

   #+begin_src shell :results verbatim :exports both
     roc-recv --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-recv 0.4.0 (62100a71dc)

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan ./roc/roc-send --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-send 0.4.0 (62100a71dc)

** Precheck

- *iwconfig*

   #+begin_src shell :results verbatim :exports both
     sudo iwconfig wlp0s20f3
   #+end_src

   #+results:
   #+begin_example
   # OUTPUT:
   wlp0s20f3  IEEE 802.11  ESSID:"blackmesa2a"
             Mode:Managed  Frequency:2.447 GHz  Access Point: 2C:C8:1B:21:5C:1C
             Bit Rate=270 Mb/s   Tx-Power=22 dBm
             Retry short limit:7   RTS thr:off   Fragment thr:off
             Encryption key:off
             Power Management:on
             Link Quality=70/70  Signal level=-38 dBm
             Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
             Tx excessive retries:1  Invalid misc:0   Missed beacon:0

   #+end_example

   #+begin_src shell :results verbatim :exports both
     ssh orangepi-lite2.lan sudo iwconfig wlan0
   #+end_src

   #+results:
   #+begin_example
   # OUTPUT:
   wlan0     IEEE 802.11  ESSID:"blackmesa5a"
             Mode:Master  Channel:42  Access Point: 2C:C8:1B:21:5C:1D
             Bit Rate=433 Mb/s   Tx-Power:32 dBm
             Retry min limit:7   RTS thr:off   Fragment thr:off
             Encryption key:off
             Power Managementmode:All packets received
             Link Quality=5/5  Signal level=-56 dBm  Noise level=-94 dBm
             Rx invalid nwid:0  Rx invalid crypt:0  Rx invalid frag:0
             Tx excessive retries:76  Invalid misc:0   Missed beacon:0

   #+end_example

- *ping*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 orangepi-lite2.lan
   #+end_src

   #+results:
   : # OUTPUT:
   : PING orangepi-lite2.lan (192.168.0.140) 56(84) bytes of data.
   :
   : --- orangepi-lite2.lan ping statistics ---
   : 1000 packets transmitted, 1000 received, 0% packet loss, time 8752ms
   : rtt min/avg/max/mdev = 1.615/11.529/108.580/10.360 ms, pipe 11

* SECTION Library code
  :PROPERTIES:
  :CUSTOM_ID: library-code
  :END:

#+begin_export markdown
<details>
  <summary>Click to expand</summary>
#+end_export

#+transclude: [[file:../library.py]]  :src jupyter-python :rest ":results none"

#+begin_export markdown
</details>
#+end_export

#+begin_src jupyter-python :exports both
  data = load_csv('roc_recv.csv')
  data.keys()
#+end_src

#+results:
: dict_keys(['m', 'd', 't', 'f'])

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('jitter', data['m'][:,2]/1e6),
                stats_table('peak-jitter', data['m'][:,3]/1e6))
#+end_src

#+results:
|       | *jitter*    | *peak-jitter* |
|-------+-------------+---------------|
| *min* | 3.119 ms    | 4.987 ms      |
| *max* | 1200.326 ms | 1200.325 ms   |
| *avg* | 5.627 ms    | 671.914 ms    |
| *p95* | 5.795 ms    | 1200.325 ms   |

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('niq-latency', data['t'][:,1]/44100*1e3),
                stats_table('target-latency', data['t'][:,2]/44100*1e3))
#+end_src

#+results:
|       | *niq-latency* | *target-latency* |
|-------+---------------+------------------|
| *min* | -673.696 ms   | 217.687 ms       |
| *max* | 1144.853 ms   | 1088.435 ms      |
| *avg* | 710.886 ms    | 740.902 ms       |
| *p95* | 1119.116 ms   | 1088.435 ms      |

